[
  {
    "title": "Swanson supporters rally!",
    "date": "Tuesday November 17th",
    "body": "Swanson supporters rally outside of Pawnee City Hall hoping to catch a glimpse of our future-president after his New England tour, where he talked to an official for 5 minutes and spent the rest of the week in the Vermont forests harvesting maple syrup.",
    "link": "http:\/\/parksandrecreation.wikia.com\/wiki\/Ron_Swanson"
  },
  {
    "title": "Swanson promises to toughen up America",
    "date": "Thursday November 12th",
    "body": "Swanson promises to ship all vegetables, fruits, \"raw food\", and all other \"hippy food\" to a remote island in the Pacific in order to toughen up America. Vows to replace all hippy food in elementary schools with pork crackling and steak.",
    "link": "http:\/\/parksandrecreation.wikia.com\/wiki\/Ron_Swanson"
  },
  {
    "title": "Swanson refuses Super PAC donations",
    "date": "Monday November 2nd",
    "body": "Swanson refuses Super PAC donations; relies only on the \"blood and sweat\" of his team and his cached gold bars that may or may not be buried in various locations around Pawnee.",
    "link": "http:\/\/parksandrecreation.wikia.com\/wiki\/Ron_Swanson"
  },
  {
    "title": "Physical tests or no tests",
    "date": "Wednesday October 14th",
    "body": "Swanson stands up against the mass media by not participating in the first GOP debate because of Swanson's personal view to never participate in any activity that doesn't involve physical tests. \"Winners only exist if said activity involves a physical competition or an IQ test.\" Consequently, holds his own 'debate' against himself. Swanson was the definitive winner of the first ever Swanson-Swanson Debate; promises to \"abolish child labor laws\" and cut 99% from all government programs.",
    "link": "http:\/\/parksandrecreation.wikia.com\/wiki\/Ron_Swanson"
  },
  {
    "title": "Candidacy Announcement!",
    "date": "Monday September 28th",
    "body": "It's OFFICIAL! Ron Swanson announced his candidacy via Morris Code from his cabin located deep in the Hoosier National Park.",
    "link": "http:\/\/parksandrecreation.wikia.com\/wiki\/Ron_Swanson"
  }
]
